app/controllers/home_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def top
    @posts = Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def diary
    @post = Post.find_by(id:params[:id])
    @final = Post.last

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def new
    @posts = Post.all

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["content", "どｎ"], ["created_at", "2024-08-24 03:46:10.611359"], ["updated_at", "2024-08-24 03:46:10.611359"]]
---
  def create
    @post = Post.new(content: params[:content])
    @post.save